{
  "data": [
    {"text": "iOS 8.0.1 released, broken on iPhone 6 models, withdrawn", "comments": [{"text": "I&#x27;m still waiting for them to stabilize wifi on the iPad sith iOS 8. Their quality has really started to slip for me since 10.9 on Mac.", "score": 0}, {"text": "For those who upgraded, no need to do a restore. You can just option-click &quot;Update&quot; and downgrade the OS back to 8.0.0.Instructions: https:&#x2F;&#x2F;gist.github.com&#x2F;locriani&#x2F;f0f5f4f71a28945c3750", "score": 4}, {"text": "Upgraded shortly after it was released and suffered the consequences.  Just was able to restore back down to 8.0I had to turn iMessage off and back on again in order for Apple to re-register my number... until then I was unable to send to any existing contacts.", "score": 3}, {"text": "I think they were under a lot of pressure on the HealthKit front.  That was one of their big flagship iOS 8 features, they got all these app developers to integrate it, then iOS 8 shipped and they had a showstopper bug and wouldn&#x27;t release any apps using HealthKit.", "score": 2}, {"text": "Fix for those who already updated:  http:&#x2F;&#x2F;www.imore.com&#x2F;ios-801-kill-touch-id-and-cell-service-...", "score": 1}]},
    {"text": "Ask HN: How do US HNers get their health insurance?", "comments": [{"text": "Get it from your employer. It&#x27;s better and cheaper than what you can get in the market.You are allowed to supplement -- this may or may not make sense, but your final coverage will be a lot cheaper if you start with employer insurance.", "score": 4}, {"text": "As someone who moved from the UK to US under almost identical conditions, let me say this: If you have a job that offers health insurance 99% of the time you will be better off taking that health insurance rather than buying it directly from the exchanges.Why? At least two reasons:1. Employers are in a stronger negotiating position as insurance companies really fight for the business (it is for multiple people, so even if each one is less profitable the entire account will be more profitable with less overhead, so they WANT it).2. The people buying directly from exchanges are higher risk&#x2F;greater cost. They&#x27;re normally poorer, self employed (which includes a lot of people in physically demanding professions as well, who get injured often), and some are early retirees (pre-medicare age, but still &quot;older&quot;).Plus the biggest reason is that almost all employers pay a % of your health insurance premium. If you go with the exchange you&#x27;re paying 100% (of a higher base) rather than 70% of a lower one. So unless your employer has simply terrible health insurance, it is almost never a better idea from a financial perspective to go private.If you&#x27;re really paranoid about it, just take the employer health insurance, assuming they pay 30% and you pay 70% of the premium, take an equivalent amount out of your pay and save it (e.g. save 30% of the premium a month). Since that is what you would have been paying privately anyway (100%), now you&#x27;re just using the employer&#x27;s cut to save for a rainy day.Personally if it was up to me employer provided health insurance should be banned in the US and everyone (aside from the US Military) should be required to go out and get private coverage (e.g. car insurance). That way the prices come down, competition goes up, and certain demographics (unemployed, self-employed, early retirees, etc) aren&#x27;t unfairly &quot;punished.&quot;But I don&#x27;t see that happening any time soon (or ever) because employer provided health insurance is too heavily ingrained in US culture. Nobody even discussed destroying that link during the ObamaCare debates. So whatever...For now, until things change, employer is the way to go.", "score": 1}, {"text": "I went to http:&#x2F;&#x2F;healthcare.gov, filled out some online forms and picked a plan. It&#x27;s like Amazon.com for healthcare -- sort by brand&#x2F;price&#x2F;features, add to cart, check out. The only difference is that whatever insurer you sign up with sends out their own bill afterwards rather than paying the website.I&#x27;ve been buying my own insurance since reaching adulthood. Before the federal exchange, I typically found personal plans through http:&#x2F;&#x2F;eHealthInsurance.com, though they have less selection now than before the exchange. I think some insurers in states with an exchange pulled out of the private comparison sites like this.", "score": 0}, {"text": "Full time employed, health insurance through my employer.Group coverage (i.e. employer-based coverage) is the best insurance you can get in the US because of a number of already-given reasons, as well as the fact that they can&#x27;t reject you for a preexisting condition.  All private plans will exclude preexisting conditions, so if you&#x27;re already one some medication or treatment, you will have to wait at least a year before your insurer will cover it.I was a freelancer on a private plan previously.  Private plans were kind of bullshit (and very expensive), but I don&#x27;t know if the ACA has changed that.I would like to see Canada-style single-payer health care in the US, but I think it will be a couple of decades before we do.", "score": 2}, {"text": "Your options depend on where you live.I signed up for Covered California, which is subsidized insurance. My husband (non-US citizen, but perm resident) is part of my plan. This depends on what state you live in. Some states rejected the federal healthcare funds.As for employer contributions, it depends on the employer -- I offer my employees insurance. If they choose NOT to take it, I don&#x27;t give them a pay bump -- the cost per employee is negligible, and insurance is not offered in lieu of higher pay here. The purpose of me buying insurance for employees is mostly to ensure they&#x27;re healthy while working for us, and getting care so as not to sicken others while on the job.", "score": 3}]},
    {"text": "San Diego Researcher Crowdfunding Patent-Free Cancer Drug", "comments": [{"text": "What I don&#x27;t understand is why drugs developed with public money (government grants and non-profit charities) aren&#x27;t automatically in the public domain.", "score": 4}, {"text": "To everyone sure this will fail because of the amount of money required, ask yourself this: if you told your mom, and your neighbor, and your mailman, and your boss about the Occulus Rift, or Pebble, or The Peachy Printer, or Zach Braff&#x27;s latest movie, and the opportunity to help make those products a reality by preordering them&#x2F;donating money to them, do you really think any sizable portion of those people would be interested enough to donate?  Of course not.Most successful Kickstarter and IndieGoGo campaigns have an extremely narrow market, the early adopters of technology.  Cancer casts a wider net by several orders of magnitude.  There&#x27;s no reason to think that, with a good viral marketing campaign, something like this couldn&#x27;t raise several orders of magnitude more money than the most successful crowdfunding campaigns so far.", "score": 2}, {"text": "People don&#x27;t seem to realize how expensive it is to bring a new pharmaceutical drug to market and why this approach won&#x27;t work.A typical drug will cost between $1bn-$2bn and take about a decade of work by the time it hits the shelves.(http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Drug_development has details for those interested)Crowdfunding at those sort of levels just isn&#x27;t feasible yet.", "score": 1}, {"text": "Many years ago, I worked in a lab where I synthesized a variant of Interferon using solid phase peptide synthesis. It was all manual work, using pretty basic materials. It&#x27;s just a peptide after all.I finished at 11 PM. Cleaned it up, walked across the street to probably one of the world&#x27;s most respected Cancer Hospitals. Gave it to the MD on staff, he said we&#x27;ll try it now. Right now.A lot of things go on when people are at life and death cross roads. Lots of things out of the mainstream. When all hope is gone, sometimes miracles can happen.", "score": 3}, {"text": "I think the negative comments on here have got it upside down. I research and treat cancer, and I think this is great. The fact that it costs billions to develop a drug is why we should support novel pathways of organising drug development, rather than disparaging it.It may not really be obvious from the outside, but there is a coming crisis in that we won&#x27;t as a society be able to afford new cancer drugs. It is regularly reported that new drugs which are typically priced around US$120k per year (for multiple years in some cases) are not cost effective. Case in point: crizotonib. This is a drug that works very well at shrinking tumours and controlling disease in incurable lung cancer. It is targeted - it only works if your tumour has a particular gene fusion, which occurs in about 4% of lung cancer patients. It is well tolerated compared to chemotherapy. It&#x27;s the kind of personalised medicine we are hoping to achieve more broadly in the future. And the way it is priced isn&#x27;t cost effective [1].I can guarantee you that the coming surge in immunotherapies will be exorbitantly priced. And these are drugs we will be giving not to 4% of cancer patients, but &gt; 50% of advanced cancer patients in a given tumour type.These problems are even worse in countries where the government pays for drugs, because they are far more restricted in what they can afford. Patients just end up missing out. And if you think having cancer is bad enough, knowing there is a drug that might help and not being able to afford it is just heart breaking.So good luck to them, I hope they can draw some money away from nonsense like crowd funding potato salad.[1] http:&#x2F;&#x2F;jco.ascopubs.org&#x2F;content&#x2F;early&#x2F;2014&#x2F;02&#x2F;24&#x2F;JCO.2013.53...", "score": 0}]},
    {"text": "Rethinking the origins of the universe", "comments": [{"text": "I&#x27;m not a physicist.  I imagine that if I were, this would be exciting news (that is, an exciting possibility).I am a literary critic, though, and I have to say that it&#x27;s bittersweet news at best.  Black holes are so much a part of the space-age imagination.  The article mentions Hollywood, but black holes are woven deeply into our everyday metaphors and have been for decades.   They have stood among the most wondrous things in the universe -- an awe-inspiring thing.It reminds me a bit of when the press reported that the Catholic Church had &quot;gotten rid of Limbo&quot; (the actual case was a bit more complex, and involved some fairly weighty theology).Then again, we all still talk of things &quot;being in Limbo.&quot;  Perhaps that next project will still be a black hole, even if it turns out that there&#x27;s no such thing.", "score": 0}, {"text": "I&#x27;m not at all acquainted with astrophysics but I remember seeing an article state that there was a different physicist who proved this same thing:https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=7191324A quick google shows his response to this:https:&#x2F;&#x2F;twitter.com&#x2F;abhasmitra&#x2F;status&#x2F;514804101024997376His response:&quot;Hawking radiation is unproven. And particle physicists are not aware that even without any Quantum Mechanics, classical gravitation dictates that all gravitational collapse must be accompanied by radiation. :http:&#x2F;&#x2F;link.aps.org&#x2F;doi&#x2F;10.1103&#x2F;PhysRevD.74.024010(http:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;gr-qc&#x2F;0605066v3.pdf)And then grav collapse should naturally lead to radiation supported ECO:\nhttp:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S1384107606...http:&#x2F;&#x2F;mnras.oxfordjournals.org&#x2F;content&#x2F;369&#x2F;1&#x2F;492http:&#x2F;&#x2F;mnrasl.oxfordjournals.org&#x2F;content&#x2F;404&#x2F;1&#x2F;L50And as far as non -formation of ``Event Horizon&#x27;&#x27; is concerned, in contrast to the conjectures of the present yet  unpublished paper I gave EXACT proof:http:&#x2F;&#x2F;www.ias.ac.in&#x2F;pramana&#x2F;v73&#x2F;p615&#x2F;fulltext.pdfBut phys.org never highlighted my research which is infinitely more accurate than the\n present paper whose authors are not even aware that  Question of Hawking Radiation \nWould Arise Only If There Would Already Be a Black Hole With an Event Horizon. Therefore\nThis paper is not self-consistent. But that does not matter:The lead author of this paper has CAMBRIDGE AFFILIATION.So phys.org is glad to highlight an inconsistent and yet unpublished paper by ignoring my series of my exact and original papers on the same topic.&quot;I don&#x27;t have any background in astrophysics, can anyone comment on Dr. Mitra&#x27;s response and the relation of his work to the above research?The best discussion I can find on Dr. Mitra&#x27;s work is on quora: https:&#x2F;&#x2F;www.quora.com&#x2F;Is-it-true-that-Abhas-Mitra-resolved-t...", "score": 2}, {"text": "This paper claims that black holes can&#x27;t come into existence, which is subtly different from claiming that they cannot exist. In particular, black holes can exist as long as they&#x27;ve always existed – it&#x27;s just that new ones can&#x27;t come into existence. Maybe the universe just has a fixed number of singularities. [I am not a physicist – this just struck me as an inaccurate implication in the article.]", "score": 1}, {"text": "Interesting; if the paper finds general acceptance, it&#x27;ll be fun to watch a new flurry of activity. The fairly recent controversial concept of &quot;firewalls&quot; has reinvigorated that subfield of physics.Whether black holes exist or not, there&#x27;s something really dense at the center of our galaxy. It&#x27;s a challenge to come up with a consistent non-black-hole explanation for the observed motion of stars at the galactic center.http:&#x2F;&#x2F;www.galacticcenter.astro.ucla.edu&#x2F;images&#x2F;2011orbits_a...More here: http:&#x2F;&#x2F;www.galacticcenter.astro.ucla.edu&#x2F;journey&#x2F;smbh.html", "score": 4}, {"text": "Ethan Siegel just posted a detailed response to this.https:&#x2F;&#x2F;medium.com&#x2F;starts-with-a-bang&#x2F;yes-virginia-black-hol...", "score": 3}]},
    {"text": "SlackTextViewController: A new growing text input for iOS", "comments": [{"text": "As someone that doesn&#x27;t do iOS development it boggles my mind that you guys have to build this feature into your apps.", "score": 1}, {"text": "Apple developed Swift to make developer&#x27;s more expressive and efficient yet they do not provide simple controls like this. Can&#x27;t tell you how many hours I wasted in the chat portion of my app trying to get a simple growing text input to work!", "score": 4}, {"text": "So I&#x27;m making iOS apps sometimes, but have not implemented a chat feature.Why would I want to use this rather than a UITableView where I append the newest message in the end of the UITableView every time (you&#x27;d have to increase it&#x27;s length +1 for each new message, but hey that may be ok)?", "score": 2}, {"text": "&gt; Inverted mode for displaying cells upside-down (using CATransform) -- a necessary hack for some messaging apps (including ours)Care to elaborate? Sounds intriguingly crufty.", "score": 3}, {"text": "cool.  I was just shopping for a new growing text view since HPGrowingTextView seemed like it was not maintained and buggy on IOS 8.I settled on https:&#x2F;&#x2F;github.com&#x2F;oseparovic&#x2F;MessageComposerView.It&#x27;s nice, simple, and does the trick.  However, I will definitely checkout SlackTExtViewController.For people not in IOS development: yes this is crazy that it is not built in.  But our tool chain is better :)", "score": 0}]},
    {"text": "CVE-2014-6271: Remote code execution through bash", "comments": [{"text": "According to http:&#x2F;&#x2F;wiki.bash-hackers.org&#x2F;syntax&#x2F;basicgrammar it appears that this is because bash allows functions to be exported through environment variables into subprocesses, but the code to parse those function definitions seems to be the same used to parse regular commands (and thus execute them).Edit: after a brief glance over the affected code, this might not be so easy to patch completely - the actual method where everything interesting starts to take place is initialize_shell_variables in variables.c and parse_and_execute() in builtins&#x2F;evalstring.c, so parsing and execution happen together; this is necessary to implement the shell grammar and is part of what makes it so powerful, but it can also be a source of vulnerabilities if it&#x27;s not used carefully. I suppose one attempt at fixing this could be to separate out the function parsing code into its own function, one which can&#x27;t ever cause execution of its input, and use that to parse function definitions in environment variables. This would be a pretty easy and elegant thing to do with a recursive-descent parser, but bash uses a lex&#x2F;yacc-generated one to consume an entire command at once...However, all in all I&#x27;m not so sure this ability to export funcdefs is such a good idea - forking a subshell automatically inherits the functions in the parent, and if it&#x27;s a shell that wasn&#x27;t created in such a manner, if it needs function definitions it can read them itself from some other source. This &quot;feature&quot; also means environment variables cannot start with the string &#x27;() {&#x27; (and exactly the string &#x27;() {&#x27; - even removing the space between those characters, e.g. &#x27;(){&#x27;, doesn&#x27;t trigger it) without causing an error in any subprocess - violating the usual assumption that environment variables can hold any arbitrary string. It might be a rare case,  but it&#x27;s certainly a cause for surprise.", "score": 3}, {"text": "Funny, this works even after bash fix &#x2F; upgradeenv X=&#x27;() { (a)=&gt;\\&#x27; sh -c &quot;echo date&quot;; cat eFrom http:&#x2F;&#x2F;seclists.org&#x2F;oss-sec&#x2F;2014&#x2F;q3&#x2F;672", "score": 2}, {"text": "It might still be an issue. The patches may not have done enough.$ env X=&#x27;() { (a)=&gt;\\&#x27; sh -c &quot;echo date&quot;; cat echohttps:&#x2F;&#x2F;twitter.com&#x2F;taviso&#x2F;status&#x2F;514887394294652929#env X=&#x27;() { (a)=&gt;\\&#x27; bash -c &quot;echo echo vuln&quot;; [[ &quot;$(cat echo)&quot; == &quot;vuln&quot; ]] &amp;&amp; echo &quot;still vulnerable :(&quot;", "score": 1}, {"text": "Here&#x27;s how to patch Ubuntu 8.04 or anything where you have to build bash from source:  #assume that your sources are in &#x2F;src\n  cd &#x2F;src\n  wget http:&#x2F;&#x2F;ftp.gnu.org&#x2F;gnu&#x2F;bash&#x2F;bash-4.3.tar.gz\n  #download all patches\n  for i in $(seq -f &quot;%03g&quot; 0 25); do wget     http:&#x2F;&#x2F;ftp.gnu.org&#x2F;gnu&#x2F;bash&#x2F;bash-4.3-patches&#x2F;bash43-$i; done\n  tar zxvf bash-4.3.tar.gz \n  cd bash-4.3\n  #apply all patches\n  for i in $(seq -f &quot;%03g&quot; 0 25);do patch -p0 &lt; ..&#x2F;bash43-$i; done\n  #build and install\n  .&#x2F;configure &amp;&amp; make &amp;&amp; make install\n\n\nNot sure if Ubuntu 8.04 with custom built bash will be upgradable to 10.04??", "score": 0}, {"text": "There&#x27;s some misunderstanding of how the one-liner works, so here&#x27;s a writeup.You can break the one-liner into two lines to see what is happening.    1. hobbes@media:~$ export badvar=&#x27;() { :;}; echo vulnerable&#x27;\n    2. hobbes@media:~$ bash -c &quot;echo I am an innocent sub process in &#x27;$BASH_VERSION&#x27;&quot;\n    3. bash: warning: badvar: ignoring function definition attempt\n    4. bash: error importing function definition for `badvar&#x27;\n    5. I am an innocent sub process in 4.3.25(1)-release\n\n1. Create a specially crafted environment variable.  Ok, it&#x27;s done.  But, nothing has happened!2. Create an innocent sub process.  Bash in this case.  During initialization...3. ...bash spots the specially formed variable (named badvar), prints a warning,4. ...and apparently doesn&#x27;t define the function at all?5. But other than that, the child bash runs as expected.And now the same two input lines on and OLD bash:    1. hobbes@metal:~$ export badvar=&#x27;() { :;}; echo vulnerable&#x27;\n    2. hobbes@metal:~$ bash -c &quot;echo I am an innocent sub process in &#x27;$BASH_VERSION&#x27;&quot;\n    3. vulnerable\n    4. I am an innocent sub process in 4.3.22(1)-release\n\n1. Create a specially crafted environment variable.  Ok, it&#x27;s done.  But, nothing has happened!2. Create an innocent sub process.  Bash in this case.  During initialization...3. ...bash accidentally EXECUTES a snippet that was inside the variable named &#x27;badvar&#x27;?!4. But other than that, the child bash runs as expected.  Wow, I should update that machine. :)", "score": 4}]},
    {"text": "Up, Up, Down, Down, Left, Right, Left, Right, Up, Up, Up, Up", "comments": [{"text": "Every time I need to unlock developer settings in a recent Android phone I get a little nostalgic for the codes of old.If you&#x27;re of that era you likely also remember...007 373 5963...and...JUSTIN BAILEY------ ------", "score": 0}, {"text": "My first thought was that it was a sequence for a Mortal Kombat fatality.", "score": 3}, {"text": "The contra code . . . you&#x27;ll never forget . . .popularized among North American players in the NES version of Contra, for which it was also dubbed both the &quot;Contra Code&quot; and &quot;30 Lives Code&quot;https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Konami_Code", "score": 4}, {"text": "A friend of mine worked on the netflix debugging tools for a majority of their players (tvs, blu-ray players, consoles, etc) and there are a number of remote combinations like that inside the players to bring up all sorts of goodies.", "score": 2}, {"text": "Heh, it&#x27;s pretty close to the Konami Code, I wonder if that was the inspiration? https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Konami_Code", "score": 1}]},
    {"text": "Relativistic hash tables", "comments": [{"text": "In case people find it interesting, this is very similar to how one efficiently builds a search engine for high QPS and update rate (lockless realtime document index), though that example is slightly more involved than a hash map.The basic premise is that the entry point to your data structure (or internal pointers) can change over time. You don&#x27;t dismantle older entry points&#x2F;pointers until all older readers release, though you don&#x27;t have to wait for all concurrent readers to exit.", "score": 1}, {"text": "Could someone explain all of the grounds?", "score": 3}, {"text": "I wrote the paper and dissertation this work was based on, and I&#x27;m happy to answer any questions people might have.(Really awesome to see a production implementation of this.)", "score": 2}, {"text": "Forgive me if this is stupid, but this could work for implement a concurrent VM?", "score": 0}, {"text": "Maybe I&#x27;m daft, but the growing and shrinking explained looks like how you&#x27;d do it for any hash table, is that not how a normal one works? Do normal hash tables &quot;freeze the world&quot; to change tables or something?Looks to me like an &quot;RCU grace period&quot; (not sure what this is, sleep maybe?) is introduced to allow concurrent threads time to &quot;finish reads&quot; in between pointer changes.", "score": 4}]},
    {"text": "Programming the Atari ST 20 Years Later", "comments": [{"text": "I learned basic on a atari 800 i got for christmas because our bundle included the cartridge.  After about 6 months i managed to get my parents to buy me a tape drive so i wouldn&#x27;t have to retype programs completely out each time.I think my biggest day of my programming life was when i got an advanced book that showed me what gosub was for.", "score": 0}, {"text": "I wrote an Atari ST emulator out of nostalgia called STonX myself when I started to use a Unix box (Sun IPC), I believe it was the first open source ST emulator (&#x27;94 or &#x27;95, also the first for Unix with big&#x2F;little endian support, ran on Linux, DECstations with Ultrix, Sun&#x2F;Solaris etc.). It was somewhat special in that it supported &quot;native&quot; graphics capabilities, i.e. bigger resolutions than 640x400 using VDI if the host hardware supported them. Had a bunch of bugs though that I never got round to fixing...My memories of the ST were fond: it was quite powerful yet still a system that you could look into every aspect of, you could single-step through the OS in ROM if you wanted and there weren&#x27;t dozens of strange tasks running all the time like today. When MiNT (Unix-like OS layer) was released, we could even play in the Unix league using gcc, bash, tcsh, emacs.", "score": 4}, {"text": "An Atari ST was the first computer I ever owned.I sent my father to the shops to buy a C64 and he was convinced by a salesman that what I really wanted was an ST.Atari shortly after pulled out of Australia and I found myself paying $15 a month for copies of ST Format from England.Seeing screenshots of the OS bring up some serious childhood flashbacks.", "score": 2}, {"text": "&quot; A dark shadow falls over me when I think about all the hours of work spent by Atari ST engineers to build something almost lost to oblivion.&quot;Sigh. There are sooooooooo many things people have built which are sitting there in &quot;oblivion&quot; now. One of the most awesome things of playing with turn of the century computers (like PDP 11&#x27;s or VAXen) is that you can see the stuff they did, in the contraints they had, and really understand how amazingly inefficient&#x2F;overpowered OSes are today. When you have only one font, its fixed width and size, and it comes out of a ROM you don&#x27;t worry about typography for example.", "score": 3}, {"text": "Sorry, but the Amiga was wayyyy better.", "score": 1}]},
    {"text": "How to Design Classes (2012) [pdf]", "comments": [{"text": "Is there a mirror of this anywhere? I can&#x27;t get to it right now.Edit: working again", "score": 3}, {"text": "666 pages... Coincidence? I don&#x27;t think so.", "score": 4}, {"text": "For those interested, it looks like programming examples are in JAVA. Probably a good read for those who never quite get classes.", "score": 0}, {"text": "The first four chapters are written with the ProfessorJ teaching environment in mind (cf. page xiii).http:&#x2F;&#x2F;www.professorj.org&#x2F;For the later chapters, the reader is encouraged to explore the concepts within a full-fledged Java or C# development environment such as Eclipse, IntelliJ, Visual Studio, etc.", "score": 2}, {"text": "Very excited to see how they project their vision (htdp, etc) onto OOP in full details.", "score": 1}]},
    {"text": "Indoor mapping with Estimote Beacons", "comments": [{"text": "Is the reason you cannot simply use a software&#x2F;cell phone GPS solution to accomplish the same thing that there&#x27;s poor granularity and potentially also poor indoor GPS reception indoors?", "score": 4}, {"text": "Low energy bluetooth is neat technology and I&#x27;m impressed with Estimote too.My question is what happens when the batteries die in these beacons if you have set many of them them up in a constellation like this for intra-room location? Do you have to replace all together and reconfigure or is there some easier way to replace individual beacons that have gone flat and reconfigure them to act exactly like the one they are replacing?", "score": 2}, {"text": "It says it doesn&#x27;t support their stickers because they are intended to be placed on moveable objects. That sounds like it is a hardware limitation, otherwise why would they be restricting their developer community? Still very excited about this.", "score": 0}, {"text": "From my experience as someone who has already implemented an complete iBeacon based iOS App that is used as an art gallery guide I don&#x27;t believe that this indoor location tracking you&#x27;re advertising is working when there is more than one person in the room.As my academic advisor always said: Every human is an 80kg water bag thats disturbing the signal.Did you test this with multiple persons in the room and if so, what was your result concerning accuracy.", "score": 1}, {"text": "Any reason why the devkit is three beacons and not four?  If you need a minimum of four.. it seems a bit daft not to have that as the default size and then sell single addon beacons as necessary.", "score": 3}]},
    {"text": "Ask HN: Hackers who cook", "comments": [{"text": "1. I cook because it&#x27;s cheap. Sometimes I cook for the ladies... err, well, actually just the one lady:my gf2. Sometimes. Depends how fancy we&#x27;re getting. No weekly meal plan3.  Simple&#x2F;fast&#x2F;practical meals, specifically stir fries and salads. We want to get into shakes (we just bought a blender)4. trying to follow Paleo5. best life hacks? Get a cook! Or use a service like BigOven, Gobble, AmazonFresh&#x2F;GoogleShoppingExpress,TheStoneSoup (5ingredients, 10min recipes) or just be disciplined about developing good habits! BigOven, for example let&#x27;s me find stuff to cook fast. It&#x27;s on iOS, Windows, Android and it even lets you import from text. Only thing I hate about the service is the fact you&#x27;re locked in because there&#x27;s no way to export your data...", "score": 3}, {"text": "Hey, Cucumbertown looks really cool. Can you talk a bit about your tech stack and major design decisions? I&#x27;m thinking of something similar for a different niche.", "score": 0}, {"text": "(1. why?) Well it does save cash :) I only consider it recreation when I have friends over. The main reason, however, because it&#x27;s normal. Probably a cultural thing (not judging!). In the Netherlands (or at least in my circles), it&#x27;d be considered &quot;weird&quot; if you eat out (or takeout) more than once or twice a week. It&#x27;s just considered normal that people cook, like doing laundry. Also means it&#x27;s not going to be fancy always, sometimes it&#x27;s just fuel and nutrients (some&#x2F;any combo of vegetables, proteins and carbs). I also believe it&#x27;s more expensive to eat out than in the US, relative to cooking from basic ingredients (or maybe vegetables are cheaper, I dunno). I can make tasty dinner for about €5-7 (two portions). Getting something healthy readymade for you is at least €10 (one portion).(2. planning) Remember that article a while back about &quot;people sized cities&quot; (or something like that)? In NL, if you live in a medium-size town, a supermarket is never farther away than a 5 minute bicycle ride. My closest one is less than 200m, the next (bigger) one is 700m. But I&#x27;m lucky :) There are people that do weekly shopping of course, usually either big families or people that live out in the country, where the nearest supermarket is a cardrive away (like in the US).\nBesides shopping-planning, if I cook for myself, I usually make at least two-three portions because it&#x27;s really the same amount of work as making one. Also you can&#x27;t buy many kinds of fresh ingredients in single-meal amounts. So I do need to plan ahead to be able to eat all that stuff before it goes bad. Sometimes that means having weird dinner-type things for breakfast. I hate throwing food away, but I try not to be too hard on myself if it means I ate healthy stuff, but messed up on the planning.(3. what do I cook) Everything. My staple go-to meals, however are some kind of pasta-vegetable-salad (fusili pasta, cherry tomatoes, any kind of salad vegetables, cucumber, paprika, shallots, etc, any cheese, salami, bacon, eggs, olives etc whatever I have in the fridge + dressing from mayo+mustard+honey) and broccoli + fried tempeh or organic sausages. Also, brussel sprouts. These last two vegetables seem (for me) to cover most nutrients I&#x27;ve been missing when I feel I haven&#x27;t been eating healthy. At least I feel better immediately :)I also love cooking weird and&#x2F;or special stuff. I could write a whole series of posts on that. And I did, but the stories&#x2F;pictures are spread over many different parts and ages of the Internet.(4. diet) Not really. I did paleo&#x2F;keto for a while, twice, it was fun, tasty and really interesting to find your body can go into a different &quot;mode&quot; (ketosis) for energy. However I found that my physical condition for running improved a great deal when I added more carbs to my diet. I probably did something wrong, cause many people seem to be able to do sports just fine on keto diets. Anyway, these days I just don&#x27;t eat a lot of carbs. I find I have to pay attention to eating enough (sorry I&#x27;m probably weird), both calorie-wise and nutrients (as I said, broccoli&#x2F;sprouts).(5. hacks and tips) I have zillions. Get a good knife. Learn how to use your microwave effectively (it cooks broccoli and many other things to perfection, if you know how--I&#x27;ll explain if asked). Dishwashing machine. Check out the kitchen-tools section in shops every now and then, see if there&#x27;s any tools that may make your particular way of cooking easier. If you don&#x27;t have bbq tongs, get them, even if you&#x27;re vegetarian. Fresh ginger keeps for a long time in the freezer. Get to know the chemistry behind cooking, preparing food, nutrition, etc. Watch Alton Brown&#x27;s series Good Eats, it&#x27;ll not only teach you loads of basic cooking techniques, but also the how &amp; why behind these techniques, and even the chemistry&#x2F;science of it. Plus it&#x27;s entertaining. Just pick some random episodes on topics you think are interesting. I guarantee you&#x27;ll learn something useful from every one of them. Many can be found on YouTube.", "score": 4}, {"text": "1. Why do you cook? Is it to save cash or is it recreation? Or something else?I cook as another creative outlet, as a way to relax and a way to put a break between work and personal time. It&#x27;s a nice ritual to come home and cook a quick dinner, or take the time to make a big meal on a weekend and try something new.Cooking for myself is also much cheaper most of the time, especially this time of year when we get so many great vegetables in season.2. Do you plan ahead? Like a weekly meal plan?I tried to do a weekly plan, but it just didn&#x27;t work for me. I like to buy groceries for 2 days at a time, at most, and I enjoy the trip to the store to see what&#x27;s looking good and inspires me.The only real planning I do is to keep a well organized list of posts and recipes in Evernote that I want to try at some point.3. What kind of things do you cook usually?This summer I&#x27;ve been cooking a TON of fish and fresh corn succotash(like a cooked corn salsa). In the cooler months I love making a universal broth for ramen, braising greens ,etc and have it on hand for a couple days. And lots of simple roasts with a primary protein like chicken or pork and a ton of vegetables.Food52 and Saveur are my go-tos for great recipes and a little inspiration. If you&#x27;re looking for something simple and jsut starting out, I recommend sidechef.com for great beginner recipes and tips from start to finish.4. Do you follow any diet? Atkins, Slow Carb etc.I like the slow carb foods and naturally gravitate towards that without having to follow a real plan. Beans, lentils, proteins and a ton of vegetables are always staples on my plate at home.5. Do you have any life hacks, tips to be more productive as a cook?Just like exercise, reading, social time, it&#x27;s all about how you prioritize. Cooking can be a quick 10 minutes to make a simple frittata, or several hours for something more elaborate on a weekend.Personally, if I&#x27;m working from home, I schedule a break to start cooking dinner in the afternoon. And I usually cook enough to have leftovers to play with for another day or two. It saves time and money to make larger batches.Other hacks are focusing on one-pot dishes and the slow cooker in the winter. I love putting a bunch of stuff in the slow cooker in the AM and coming home to a done meal at the end of the day with no additional work needed.", "score": 1}, {"text": "1. I enjoy performing the motions to a satisfactory result. I enjoy sharing that result with others. I enjoy (sometimes) creating new things.2. Sometimes I will go shopping having a specific meal in mind, other than that -- no.3. Something fast, so I won&#x27;t be eating fastfood or prepared meals. Something elaborate, so that I can make an event feel more celebratory. Something nostalgic, so that I get to remember how things used to be. Mostly it&#x27;s something fast though.4. I try to minimize processed foods and maximize fish consumption. Really that&#x27;s about it.5. Don&#x27;t over-do it. It&#x27;s a bit like sculpture, where you take away from the base; only you add to the base. Don&#x27;t be afraid to mess it up, but plan accordingly.", "score": 2}]},
    {"text": "Adding strlcpy() to glibc", "comments": [{"text": "Hopefully it will be added to the standard C library so it will be everywhere - eg Microsoft, Apple, etc.", "score": 4}, {"text": "Deep in the comments, &#x27;slibc&#x27; is mentioned.  I hadn&#x27;t known about it, but this library provides str..._s() implementations of all the standard str...() functions as defined in Annex K of the C11 standard (which I also hadn&#x27;t known about).https:&#x2F;&#x2F;code.google.com&#x2F;p&#x2F;slibc&#x2F;At a glance, this seems like a better solution than any of alternatives:  require the buffer length to always be specified, and call a user controlled handler instead of allowing an overflow.  This handler defaults to abort().While there are fine arguments to be made for using a real string library like bstring, are there downsides to the str_s approach compared to using the str, strp, or strl family of functions?", "score": 2}, {"text": "I agree with drepper on this; it&#x27;s a solution in search of a problem.  You should either know WTF you can accept or use a higher level construct that can resize.  Silent truncation seems bad - truncation attacks are a real attack vector that SSL, for example, tries to prevent.", "score": 0}, {"text": "Safe string handling in C can be done, but not with char*.PHP&#x27;s Zend Engine has safely-handled strings, for example, but we do that by reference-counting them and having an explicit length.", "score": 1}, {"text": "I usually use strncpy and enforce null at end, that virtually is the same that does a strlcpy.But if you know how long is the source and destiny buffers (and if you are using str[nl]cpy, probably you know it), you could use memcpy and get a much more faster copy.", "score": 3}]},
    {"text": "How to Migrate 50M Records from Mongo to PostgreSQL in Less Than a Day", "comments": [{"text": "why use python for real work?For reference, I was handling 30M daily records in about an hour on hardware 15 years ago.  This performance is absurd.", "score": 4}, {"text": "This is a perfect example of doing something row by row instead of in a data sets is bad for anything with over a million rows. Bulk Dump &#x2F; Copy Load and then run the rules to clean up data.", "score": 1}, {"text": "This requires you to wait for the whole batch to complete, instead of starting a new process as soon as one finishes.For these cases, I started using GNU parallel instead of plain shell. It does the heavy concurrency lifting for you, and even allow almost seamless parallelization across different machines.For example, your final code could be written as such:  parallel .&#x2F;settings.sh python bin&#x2F;migrate_media.py {} $LIMIT ::: $(seq 0 $LIMIT $NUMPLAYLISTS)\n\nhttp:&#x2F;&#x2F;www.gnu.org&#x2F;software&#x2F;parallel&#x2F;", "score": 2}, {"text": "Seems like this would&#x27;ve been a completely ideal place to rock some mongo_fdw, which would give postgres the ability to query and extract data directly from mongo. https:&#x2F;&#x2F;github.com&#x2F;citusdata&#x2F;mongo_fdw", "score": 0}, {"text": "&quot;We were mostly I&#x2F;O bound so we knew we’d like to use gevent’s quick task switching so we could write the maximal amount of data per-process. A single process really constrained us to one vCPU. Therefore, to speed it up meant running more than one process.&quot;Wait. What?! The response to being I&#x2F;O bound is not using more processes...", "score": 3}]},
    {"text": "Cling: an interactive C++ interpreter, built on top of Clang and LLVM", "comments": [{"text": "How does something like this work in general? My naive idea about how to make such a thing essentially seems like a virtual machine, which is quite a bit of effort.", "score": 1}, {"text": "Link to previous HN submission 2 years ago (it has moved on since then):https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4373334", "score": 3}, {"text": "This might be interesting.  I&#x27;m not actually interested in C++ (any more) but I&#x27;m still looking for the easiest possible way for me to get into LLVM.  I think “learning LLVM” seems like the obvious next iteration of what used to be “learning assembler”, except this time around, it&#x27;s actually portable.  I love experimenting with languages and having an LLVM backend ready at my fingertips must feel like Programmer&#x27;s Heaven...", "score": 4}, {"text": "I think every language would be more productive if it were interpreted at development and compiled at production.", "score": 2}, {"text": "One of my favorite early Rust features, in theory, was the interactive shell called &quot;rusti&quot;. In practice it was awful to use because it was slow, crashed all the time, and required whole blocks of code be entered at once (declaring, defining, and using a variable for example). Some of that was attributable to beta status of the language but it seems like they ditched it in the end. Is there actual value to this sort of thing for languages that are classically compiled instead of interpreted? At least for Go, Rust, and C speed of compilation is less of an issue overall but compiling C++, even with clang, is so much of a bear that I can&#x27;t see this catching on.", "score": 0}]},
    {"text": "The Underground Wind Bulbs of Utah", "comments": [{"text": "Seems like if there is a salt mine they could make some sort of battery out of the salt.", "score": 1}, {"text": "My favorite method of short-term energy storage at scale is to use excess energy during non-peak times to pump water uphill, back into a reservoir.  The topology has to be right for it (and obviously it requires there to be plenty of excess water), but it&#x27;s a simple method to smooth out peak demand.", "score": 4}, {"text": "Wikipedia has rather more information on this, including (in the History section) a bunch of examples of this at scale going back to the 70shttp:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Compressed_air_energy_storage", "score": 2}, {"text": "This is pretty neat. I wonder how cost effective it is vs compressed fluid storage.", "score": 3}, {"text": "What if there&#x27;s a leak in the salt mine?I mean, a salt mine is just a large hole in the ground. What assurance do we have that it doesn&#x27;t have any hairline cracks through which compressed air can escape?And if the air does begin to escape and erode the surrounding rock, how do you prevent a massive explosion occurring at some point? Is the weight of the rock above the cavern enough to keep the air compressed at 1100 psi?", "score": 0}]},
    {"text": "OpenGov, a startup intended to transform the way governments manage tax dollars", "comments": [{"text": "Definitely think this is a step in the right direction.Unfortunately, it looks like this solution does not address the balance sheet side of the equation, which is where most towns are in dire straights (even if they don&#x27;t admit it as they have more latitude in not recognizing the future costs of say pensions than corporations do). Until people have true transparency into this area, it will be hard to make good decisions as an electorate.Again, think its a great step forward...on a very long road", "score": 3}, {"text": "See Balance Sheet here: www.sausalitoca.opengov.comhttps:&#x2F;&#x2F;sausalitoca.opengov.com&#x2F;transparency#&#x2F;624&#x2F;breakdown=...", "score": 1}, {"text": "As somebody who is interested in improving my awareness of local politics, I think this is really great. Not only have these guys created a beautiful interface for viewing budget allocations, they have actually convinced governments to use it. I look forward to the day this comes to San Francisco. Even those with no interest in politics will be better off for it, as greater transparency will surely improve the way our money is being spent.As usual, most HN comments are negative. I&#x27;ve met Balaji, and he can talk some good hype when he wants to, but I think it&#x27;s hardly disingenuous or linkbaity to emphasize that OpenGov already has customers with $50 billion in revenues&#x2F;spending. It could potentially be used by any city, state, or national government, or really any large organization spending public dollars. That&#x27;s an enormous potential market.", "score": 4}, {"text": "If you want to learn more about the Civic Tech&#x2F;Gov Tech space, checkout the Code for America Summit live stream when it continues tomorrow at http:&#x2F;&#x2F;www.codeforamerica.org&#x2F;summit&#x2F;(Shameless plug: I will be presenting about our start-up tomorrow)It&#x27;s not just A16Z who&#x27;s getting into this space. Check out the new fund by Ron Bouganim.http:&#x2F;&#x2F;www.washingtonpost.com&#x2F;blogs&#x2F;the-switch&#x2F;wp&#x2F;2014&#x2F;09&#x2F;15...And obviously, Y-Combinator is now getting into the government space. https:&#x2F;&#x2F;www.ycombinator.com&#x2F;rfs&#x2F;It&#x27;s been a slow build, but the industry is huge.", "score": 0}, {"text": "Pretty sad to see HN become a parody of itself on a near constant basis: half of the comments attacked the article as &quot;link bait&quot; without even addressing the actual content.  I&#x27;ve been watching OpenGov closely for the last year and have been impressed (and jealous that I didn&#x27;t start this myself having worked in big gov IT shops my whole career and half jokingly playing around with the idea of a SAAS offering for publishing budget data online; something that seemed a difficult enough problem that I though it was magic when I was able to see it firsthand with OpenGov&#x27;s software)", "score": 2}]},
    {"text": "BlackBerry, Under New Leadership, Unveils Its Newest Smartphone", "comments": [{"text": "Why only a 3 line keyboard?  Having to use an on-screen keyboardlet for punctuation and #&#x27;s seems to detract from the point.If they were serious about spreadsheets, why not shrink the keyboard horizontally and make the first phone (in a long time?) with a numeric keypad.", "score": 1}, {"text": "In contrast to many of the others, I think the industrial design of this thing is beautiful. Of greater potential interest around here is they relatively quietly added the Amazon App Store to it.Still, it amazes me that they don&#x27;t do something fairly obvious like team up with Bloomberg on becoming the mobile Bloomberg terminals, complete with the chat and coloured keys.", "score": 4}, {"text": "I know my opinion isn&#x27;t in line with the positive feedback loop culture on HN, but this phone looks like a joke!I feel like hardware keyboards on mobile devices are archaic and overhyped. I know it&#x27;s Blackberry&#x27;s key thing, but instead of trying the same old tired keyboard, why not embrace the software keyboard with some innovations? They could do some research in ultrasonic haptic feedback, shape shifting displays, even something as far fetched as claytronics to replicate the the textures and friction of everyday objects.If you like or have to use Blackberry, I guess this is the phone for you, but otherwise how can anybody want to choose a painfully mediocre device? I don&#x27;t feel sorry for their slow fade into obsolescence.", "score": 3}, {"text": "Why the hell can&#x27;t I just have my Blackberry Curve back? Please! The form factor was perfect, the battery was great, the operating system was hella snappier than my current Nexus, all it needed was to run Android apps and have a better camera. Why are they trying to sell us bathroom tiles now?", "score": 2}, {"text": "If a brand is out of fashion, of course everyone loves to join in the fun and pile on, and any innovation, good or bad, is automatically thrown onto the bonfire.It&#x27;s too bad because I think the screen is innovative, and I wish others would follow suit. Some extra space on the side is more valuable to me than more at the top. I tried a squarish LG phablet a couple years ago and loved it. Unhappily the software was poor and I had to switch to something with a more standard aspect ratio.Also, I trust Blackberry shares my priorities about productivity and security; anything to save me a few seconds each time I use it would be great. I hardly ever use my phones for anything else, other than occasional maps and web browsing. If it works well, I&#x27;m tempted, though its potential in the marketplace is worrying. And no, I don&#x27;t care if you think my phone is unfashionable.EDIT: Added a couple words to the first paragraph to clarify.", "score": 0}]},
    {"text": "Daala: Painting Images for Fun (and Profit?)", "comments": [{"text": "I&#x27;m thrilled to see people still thinking through an entirely different approach to image and video compression.", "score": 4}, {"text": "TLDR: Far better quality than low quality JPEG, same size file. Not a replacement for high quality JPEG due to visible artifacts. Major drawback is slow processing, but tweaks and a well-parallelizable algorithm should resolve this... and be ideal for GPUs (and thus very light on mobile device power consumption).Search page for &#x27;as a com&#x27; to get the definitive jaw-dropping image.", "score": 1}, {"text": "This is so great to see. I know we&#x27;re years away, but what does the HN community think it would take for Daala to reach the Opus-levels? Not just in technical achievement, but widespread usage&#x2F;hardware support? I would love to have a completely free codec dominate video.", "score": 3}, {"text": "No comment on the technical stuff, but the paint algorithm applied to the video looks really pretty.", "score": 2}, {"text": "The codec wars are almost over thanks to Moore&#x27;s Law. The decoder will soon be streamed with the content, taking up more than a couple seconds of bandwidth. And not surprisingly, the decoder will be written in Javascript&#x2F;WebCL. The codecs no longer have to be installed on the system, they can be pushed along side the content. Two to three years from now, on modern hardware, you will be able to use the codec of your choice.", "score": 0}]},
    {"text": "A Mildly Satanic New Video Game That You Can Only Play Online with Money", "comments": [{"text": "Jason Rohrer&#x27;s games are fantastic - I&#x27;d recommend his game Passage, which only lasts for five minutes.http:&#x2F;&#x2F;hcsoftware.sourceforge.net&#x2F;passage&#x2F;", "score": 4}, {"text": "I set my expectations low when I saw the empty hype the beginning of the article was building up, but this game actually sounds quite strategically interesting.I definitely see why this is the kind of game that isn&#x27;t the same without money, much like poker and backgammon. I hope there&#x27;s some kind of micropayment platform that it could eventually support to avoid the credit-card fees and the check-mailing fees.(No, not bitcoin. Most people can&#x27;t use bitcoin.)", "score": 1}, {"text": "The success of this game is partly predicated on player trust, i.e. how do I know that it&#x27;s not being rigged against me by the operator? It is a game of skill, but gives the player imperfect information (unlike chess), leaving the possibility of various forms of cheating and fraud.I am interested to see how this could be addressed.", "score": 3}, {"text": "What I thought was compelling is that a well-known indie game developer had the really smart idea to target the online-poker skilled-game competition niche that&#x27;s opened by short-sighted US laws", "score": 2}, {"text": "This is a new trend starting in gaming industry. Apple has now started approving skill-based &quot;gambling&quot; games. One such example is Dollar Candy created by Ian Ippolito (who also  created PlanetSourceCode.com and rentacoder.com). These games are addictive, you play against real human and there is money on the line in each game.Gambling had been banned for a reason for long time in many cultures - it&#x27;s all too common for poorest people to blow up their earnings in the hope of a jackpot. They do so not because they are less smart but because they are too desperate and don&#x27;t have any other opportunity to making it through. Now game creators have found a loop hole in the law aka &quot;skill-based&quot; games. I can see lot of people barely making ends burning their kids school money in these stuff while standing in grocery lines.", "score": 0}]},
    {"text": "BlackBerry goes for qwerty keyboard, again, with Passport smartphone", "comments": [{"text": "Blackberry, ditch the OS...it&#x27;s holding you back.I loved my Moto Droid Pro back in the day. I got a decent ecosystem, compact portrait qwerty package, and serviceable screen.Your problem now is that your ecosystem is toast. Trim the fat in your development house, package a nice Android OS with some throwback GUI cute shit to your old blackberry feel, and move on with your life as a hardware player.", "score": 3}, {"text": "I see a pattern in this article:&quot;said analyst Rob Enderle of Enderle Group&quot;\n&quot;Maribel Lopez, an analyst at Lopez Research, added&quot;\n&quot;Jack Gold, an analyst at J. Gold Associates,&quot;", "score": 2}, {"text": "It&#x27;s a bit of an ugly duckling device, and I&#x27;m not sure it can ever grow into a beautiful swan.", "score": 1}, {"text": "Love the Blackberry keyboard, but hate the OS. If I could get their keyboard on an Android or iPhone I&#x27;d be all over it. I don&#x27;t like touchscreen keyboards, but since they&#x27;re the only option offered on devices with an acceptable OS, I use them grudgingly. Clearly the security-first mantra that Blackberry adheres so religiously to isn&#x27;t doing them any favors--as their market share, even among the security conscious, falls precipitously.", "score": 0}, {"text": "&gt; While the Passport is almost exactly the size of a travel passport, it is much heavier at 6.9 ounces.Hilarious comparison. Must it be actually be stated that the Passport is heavier than a travel passport?Apples and oranges... Passports and passports.", "score": 4}]},
    {"text": "CVE-2014-7169: Bash Fix Incomplete, Still Exploitable", "comments": [{"text": "Earlier on a mailing list someone pointed out that there is still an awful lot of string processing going on by bash even after this afternoon&#x27;s fix.  So further bugs were likely to be found now that everyone is constantly sniffing around the place.", "score": 2}, {"text": "Can someone explain why bash is evaluating and looking for function definitions in every environment variable? What would be broken if this entire &quot;feature&quot;, whatever it is, was completely disabled?That&#x27;s almost like a C compiler looking for C programs in string literals. It just doesn&#x27;t make sense to me.", "score": 3}, {"text": "Proposed patch for CVE-2014-7169 here:http:&#x2F;&#x2F;www.openwall.com&#x2F;lists&#x2F;oss-security&#x2F;2014&#x2F;09&#x2F;25&#x2F;10I am building bash updates for Ubuntu containing the proposed fix here and will publish them once the fix has been made official:https:&#x2F;&#x2F;launchpad.net&#x2F;~ubuntu-security-proposed&#x2F;+archive&#x2F;ubu...", "score": 4}, {"text": "With the patched bash, if you run    env X=&#x27;() { (a)=&gt;\\&#x27; sh -c &quot;echo date&quot;\n\nThis is equivalent to running    date &gt;echo\n\nThat is, you can put something in the environment which causes it to drop the first token, run the result as a command, and redirect the result to the dropped first token.An example of a context where this would be exploitable, is a CGI webapp which accepts an uploaded zip file, stores it in a FAT filesystem, and and runs system(&quot;unzip &#x2F;path&#x2F;to&#x2F;file&quot;). Then putting a corrupt string in a header would cause the file to be executed, rather than unzipped.", "score": 1}, {"text": "All this &quot;echo date, cat echo&quot; business is confusing.Let me fix that for you.    hobbes@metalbaby:~$ export badvar=&#x27;() { (a)=&gt;\\&#x27;\n    hobbes@metalbaby:~$ bash -c &quot;somestring executeMe&quot;\n    bash: badvar: line 1: syntax error near unexpected token `=&#x27;\n    bash: badvar: line 1: `&#x27;\n    bash: error importing function definition for `badvar&#x27;\n    bash: executeMe: command not found\n    hobbes@metalbaby:~$ cat somestring  #it exists but is empty.\n    hobbes@metalbaby:~$ bash -c &quot;somestring date&quot;\n    bash: badvar: line 1: syntax error near unexpected token `=&#x27;\n    bash: badvar: line 1: `&#x27;\n    bash: error importing function definition for `badvar&#x27;\n    hobbes@metalbaby:~$ cat somestring \n    Thu Sep 25 11:01:35 CDT 2014\n    hobbes@metalbaby:~$ bash -c &quot;somestring echo hello&quot;\n    bash: badvar: line 1: syntax error near unexpected token `=&#x27;\n    bash: badvar: line 1: `&#x27;\n    bash: error importing function definition for `badvar&#x27;\n    hobbes@metalbaby:~$ cat somestring \n    hello\n\nGititgotitgood?  Great.  Now how the heck does anybody think that is as bad as the first one?For this one, an attacker needs to control both the environment AND the command line of the child shell.People, if those criteria are met, the attacker wins, with or without bugs.Yes, yes, there are situations where the attacker has partial control of the command line via a filename argument or whatever--whatever indeed!  That&#x27;s not even in the same category as the first bug.", "score": 0}]},
    {"text": "Docker Hub Official Repos: Announcing Language Stacks", "comments": [{"text": "Pity they choose &quot;Golang&quot; instead of &quot;Go&quot; for their default Go image. It&#x27;s called &quot;Go&quot;. And they built Docker with Go.", "score": 0}, {"text": "Maybe I&#x27;m missing something here but I don&#x27;t see this as being particularly useful?It&#x27;s a nice quick way to get an application running in Docker but realistically would you want to be depending upon these images in production?The power I see in Docker is the ability to create portable images that contain everything my application needs. I don&#x27;t want to depend upon Docker (the company) to figure out what these images should look like.Am I looking at this the wrong way?", "score": 1}, {"text": "Can someone explain to me what the fuss is about? I mean, e.g. the Java 7 dockerfile is 3 lines. Why is it better for me to FROM these images instead of copying those three lines into my own dockerfile?", "score": 4}, {"text": "I&#x27;m very happy to see Hy language among the official repos! I think more people should know about it.", "score": 2}, {"text": "Does anyone know why debian was chosen as the source for these repos? I thought they were defaulting to ubuntu.ie. https:&#x2F;&#x2F;github.com&#x2F;docker-library&#x2F;golang&#x2F;blob&#x2F;master&#x2F;1.3&#x2F;Doc...", "score": 3}]},
    {"text": "Ask HN: Get feedback on my bootstrapped web scraping as a service project?", "comments": [{"text": "Page itself looks nice, but why you&#x27;ve decided to have a custom scroll? I think it would be so much better without it. Will try to look into app itself later.", "score": 4}, {"text": "It looks great, very good job.One question you should be prepared to answer is how you compare to alternatives:- Services like Kimonolabs and Import.io- Building a scraper with Scrapy- Using ScrapehubFrom what I understand the price point of the above is lower (some are free) while still offering the same features. What can you offer that they don&#x27;t?", "score": 0}, {"text": "The UI for defining the scraper targeting rules is an A+ in my book. I&#x27;ve used a number of visual tools for this over the years but most try to do to much and the usefulness suffers. Yours doesn&#x27;t.Your price however feels off by about a factor of somewhere between 4 and 8. I haven&#x27;t really got your system usage data to fully analyse but it feels too high a price. If your using full desktops and chrome browsers and the overhead is higher than I&#x27;m expecting based on past experience then perhaps the pricing is off by a factor of only 2That also doesn&#x27;t even account for the ability to take the scrape rules, reformat them to run with a headless scraper like scrapy when the website is suitable and is able to be scraped by scrapy, offering a reduced cost scraping option powered this way, throttled back to &quot;human speed&quot; is probably best priced around $1 or $2 a month per crawl thread.I&#x27;m not saying the chrome browser powered crawling part couldn&#x27;t be so inefficient you need to charge $20 to make 1 crawler pay for itself, but if that&#x27;s the case, it&#x27;s a growth limiter you should consider ways to optimise.Right now your UI is about 10 times better than the open source Portia UI from scrapinghub, but your also 10x the cost of operating a Portia crawler. It&#x27;s just something to keep in mind.TL;DR?\nNice product, but a bit expensive.", "score": 1}, {"text": "It looks quite easy to use from your video.Which cloud provider do you use for your backend crawl, and do you run the scraper from a single node or from multiple nodes?", "score": 3}, {"text": "Needs more details, a couple of examples that instantly spring to mind:Do you spread requests out across multiple IP&#x27;s to avoid bans &#x2F; rate limiting?Do you run javascript on the pages?", "score": 2}]},
    {"text": "AWS issues unavoidable reboot schedules with short notice on many EC2 instances", "comments": [{"text": "A couple of points:Autoscaling is your friend. If you&#x27;re not leveraging it (multiple availability zones), you&#x27;re doing it wrong. Even single instances can be launched in autoscaling groups with a desired capacity of 1 to ensure that if it falls over, a new one is spun up.Point 2: AWS is likely trying to rotate capacity for updates, which means they need to evict instances. That are running on doms that they need to update&#x2F;deprecate&#x2F;etc. The longer your instances are running (or the more specialized the type of instance is), the more likely you&#x27;ll see an eviction notice. It should be part of a good practice to launch new instances often as new AMIs become available, or as private AMIs are updated for security patches, etc. - at least monthly! Autoscaling and solid config management simplifies this practice greatly.Good Luck!", "score": 0}, {"text": "Pretty crappy that you cannot immediately check if an instance has restarted on a patched host or not.I would have expected Amazon to rush out a tool you can use to check or add a little marker to the dashboard or a simple API to query. Some sort of synchronous option.Having to wait possibly hours for an email to see if your vm migrated to patched host or not is a terrible solution.", "score": 1}, {"text": "I don&#x27;t think a lot of people are really understanding how much of a larger issue this would be for us if AWS didn&#x27;t patch a major security issue before it was made public.The company has treated me very well over the years, from AWS to retail. My stuff arrives on time, if it doesn&#x27;t I get reimbursed, most of the time with an extra few bucks for my trouble. The AWS platform is more mature and feature rich than anyone else and keeps getting better.These reboots are going to save a lot of peoples butts, they wouldn&#x27;t give a 48 hour notice if they had a better option.That being said, I&#x27;m very curious to see what info is released next week.", "score": 3}, {"text": "This isn&#x27;t a direct answer, but for others who are coming to this page and need help on where to start, here is some info on what to do now from RightScale&#x27;s CTO, it also has a little comparison to what happened in Dec 2011 reboot too (just an interesting side note): http:&#x2F;&#x2F;www.rightscale.com&#x2F;blog&#x2F;rightscale-news&#x2F;aws-reboot-su...", "score": 2}, {"text": "On AWS you should be prepared for an instance to disappear at any time, for any reason. Why is a scheduled reboot such a big deal?", "score": 4}]},
    {"text": "After 6 years of programming, I'm still a developer. What am I doing wrong?", "comments": [{"text": "It would not ever occur to me to try to &#x27;promote&#x27; a developer to PM; it&#x27;s not a promotion, it&#x27;s not a normal career path, and most people wouldn&#x27;t even want to do it. If it appeals to you, let your manager know.", "score": 4}, {"text": "I agree with the other commenters. PM is not a promotion. PM is a very hard, thankless job that is hard to get right. Trust me --- you don&#x27;t want it. The PM clearly needs help and it seems like you can fill some gaps he has. I do not know the org structure in your company, but I would lobby for you to become the &quot;Lead&quot; developer -- and you can work hand in hand with the PM to make sure the project is organized correctly, that the requirements are being gathered and met, that the tools the developers need are in place. The PM should be able to take the brunt of the &quot;external&quot; networking for the team, and you can take the brunt of the &quot;internal&quot; networking to the team. You can help and learn from each other, as I am sure he has some skills that you do not (they may be soft skills).", "score": 2}, {"text": "It happens that if you are good at what you are doing you won&#x27;t be promoted, because it will be hard to find someone to replace you. So you have to clearly signal that you want to move, because for your manager it might be more comfortable to know that you are here, reliable and productive.", "score": 0}, {"text": "What you&#x27;re doing wrong is not being in the job that you want.Find a position that you want in the company where you are now, or find a position that you want somewhere else. It doesn&#x27;t have to be a full-on 100% PM job. After all, the guy you mention apparently only has a year experience himself. Everyone starts somewhere and somehow. Everyone.It won&#x27;t be easy, but it will never happen if you don&#x27;t try.As for the specific issues you have with that other guy, those are merely details and they will instantly be irrelevant once you move up or out. Forget about that immediately (I literally mean right this second), and put all your energy into finding your next position, internally or externally.Get to work.  :)", "score": 1}, {"text": "What&#x27;s wrong with being good developer, especially good developer?   I have been doing this for 23 years and still love it.   Moving from DOS&#x2F;UNIX-&gt;Win32-&gt;8051-&gt;Embedded OS-&gt;vxWorks-&gt;Networking-&gt;Storaging-&gt;Video&#x2F;Media&#x2F;Embedded Linux-&gt;Android ASOP.  Learning new things every months.BTW, if you checkout the salary level at glassdoor.com, a good engineer&#x2F;developer salary level is higher than most of the &quot;PM&quot;, Director.   A lot well run company knew this and respect this.Personally, I was moved to Marketing&#x2F;PM type of roles for a while, hated it.  Too Much politic, a lot depending who you know, party with, etc.Good engineers&#x2F;developers got respect from what you know and how well you code, understanding of issues and formulate&#x2F;architect a solution.   Ok, I am a geek.", "score": 3}]},
    {"text": "Following Sony, Samsung has stopped sales of its laptops in Europe", "comments": [{"text": "This happened in Australia as well and it really sucks. I run a 15&quot; Series 9 machine and the only thing you can fairly compare it to is a Macbook Air. They&#x27;re beautiful pieces of hardware somewhat let down by their crappy LCDs.I guess my next machine will be a Macbook.", "score": 3}, {"text": "&gt; &quot;It&#x27;s common knowledge that the PC market is in decline.&quot;Mmm, not so much. Apart from what you hear from tablet makers. It&#x27;s stagnant, but it&#x27;s not in sharp decline.Source: \n2Q13 shipments : 75,700,902 VS \n2Q14 shipments : 75,763,725Yeah, it&#x27;s &quot;common knowledge&quot; as they say, if you don&#x27;t bother checking numbers.https:&#x2F;&#x2F;www.gartner.com&#x2F;newsroom&#x2F;id&#x2F;2793921", "score": 1}, {"text": "If you are looking for a Linux compatible laptop that is somewhat similar to MacBook Air, look for Asus Zenbook UX* line. Excellent display, good but not awesome battery life, fast hardware and really good keyboard for its size. I&#x27;ve bought two UX31A&#x27;s, one for myself almost two years a go and one for my dad last Christmas. Everything else works straight away with Ubuntu other than ambient light sensor. I think there isn&#x27;t any workarounds for that.I got Lenovo X1 Carbon (2014, Touch) from work couple months ago and while it has better CPU, bigger SSD, more RAM and better GPU than my two year old Zenbook, it&#x27;s just worse. The Zenbook lid can be opened with one hand, Lenovo requires both hands. Lenovo has too heavy display and too light keyboard part combined with too tight hinges, so when trying to open the lid with one hand, the whole computer lifts up from the table.Also, Zenbooks have normal keyboards. I hate the keyboard on X1 Carbon. Instead of normal function keys, there&#x27;s  are adaptive touch keyboard thingy that tries to figure out what kind of special buttons should be shown in there with each program, but it just fails. And feels like... well it does not have real buttons, so I can&#x27;t feel a thing while using it.Also, delete button is in the upper right corner in X1 Carbon. And backspace is on the left hand side of it. And that makes no sense. Backspace is used way more often than delete, so it should be easier to hit. And upper right corner is easier to hit than almost upper right corner.And Zenbooks have normal arrow keys that are not too crowded. Lenovo decided to put page up and down right next to up arrow. When ever I accidentally hit page up or down instead of up arrow, I feel like I&#x27;m totally lost.And almost forgot, Zenbooks have good touch pads, X1 Carbon touch pad moves up and down, so it&#x27;s like a huge button. Really annoying when you just move your thumb on it and accidentally press too hard, so it registers a mouse click even tough you did not raise your finger.So, in short Asus Zenbook UX* laptops pack awesome hardware, work with Linux pretty much perfectly and have really good build quality.", "score": 4}, {"text": "Wait... what? I&#x27;m a bit confused here.Can someone please explain why Samsung isn&#x27;t selling laptops besides the article&#x27;s dismissive &quot;It&#x27;s common knowledge that the PC market is in decline.&quot;Is it that they are spinning off their laptop division, or is there is some other dominant manufacturer? Why on earth are laptops not selling?", "score": 0}, {"text": "I wonder if differences in implied warranty cut into margin in Europe.It&#x27;s not super clear what the actual standard is, but I know that (for example) a laptop that I had failed at about 13 months old because of a design flaw and in the US I was SOL, but other complainants with the same flaw in the UK had the motherboard replaced because the laptop was considered &quot;not fit for purpose&quot; which if I understand the Sale of Goods Act in the UK is good for 6 years after purchase — that could really eat into the margins in the hardware industry", "score": 2}]},
    {"text": "Miss a Payment? Good Luck Moving That Car", "comments": [{"text": "On a technical note, a &quot;starter interrupt&quot; could not reasonably affect a running vehicle (the starter motor only runs when turning over a stopped engine).  However, if these devices actually operate inline with the ignition system--delivering or interrupting spark to the fuel-air mixture during operation--that&#x27;s an entirely different matter and cause for safety concerns.", "score": 4}, {"text": "If we skip the moral indignation and look at the situation plainly, this sort of technology enables a whole subset of people to actually own cars that were considered too risky before. That&#x27;s a good thing. Given the choice between no car and a car that won&#x27;t start if I don&#x27;t pay, I&#x27;ll go with a gimped car.", "score": 3}, {"text": "It shines light on a troubling broader issue: As information and communication technologies (in which many of us are involved) spread, they put power in the hands of those who control them, from Google to Verizon to your electric company (via your smart meter) to car loan agencies. It gives them power over other people, including whether they can drive their own car.Not everyone wants to give others this power, but do we and will we have a choice? Perhaps legislators will pass laws protecting the interests of people like those reading HN, or vendors will appease us because of our economic and political power.It is the poor, powerless, and disenfranchised who will be abused, with little recourse (other than not owning a car, a phone, etc.). If something like what the article described happened to HN readers, there would be an uproar. But these things will and probably already do happen off our radar to marginalized groups.Perhaps that&#x27;s why the Internet protocols put control in the hands of the end users.", "score": 1}, {"text": "Ok, ignoring the moral repugnancy of the whole thing for a moment.&gt; T. Candice Smith, who testified before the Nevada Legislature that her car, which had a starter interrupt device installed, was shut down while she was driving on a Las Vegas freeway, nearly causing her to crash&gt; Others said their cars were shut down while idling at stoplights.How the hell is that legal?! Surely you should only be able to disable a car when the engine is not running just on safety principles.", "score": 0}, {"text": "It&#x27;s hard to break this down because there are so many different problems going on here, but let&#x27;s pretend for a minute that the moral issues related to privacy and dignity are irrelevant, and that the arbitrary credit score threshold of 640 that necessitates this system is reasonable and determined by transparent and fair processes (it&#x27;s not, but stay with me).Does this _actually_ solve a problem? Are cars that difficult to repossess? Is it possible this is a marketing gimmick and the securities backed by it are sold to investors who just really like the idea of being able to f*ck over a poor person the second he or she misses a payment? Is this really an economic innovation that lets riskier borrowers have cars, or is it a sales tactic appealing to veiled social darwinist sympathies?", "score": 2}]},
    {"text": "The economic case for paternity leave", "comments": [{"text": "As a non-american, this kind of argument is really crazy for me. This isn&#x27;t an economic discussion, but one about which kind of society we want to live. We always read all American politicians talking about the importance of the &quot;Family&quot;, but the richest nation in the World can&#x27;t afford their fathers to spend a dozen of days with their newborns?", "score": 2}, {"text": "The USA desperately needs federally mandated paid parental leave and paid pregnancy leave along with strong incentives to actually take the time off.", "score": 3}, {"text": "Overprivileged first world honkies work 8-hour shifts at cushy desk jobs, and now they want paid leave because their waifu plops out babby? Ugh...", "score": 4}, {"text": "When I was a U.S. government employee I took 34 days of paid paternity leave when my daughter was born and 28 days when my son was born two years apart.The notion that the U.S. doesn&#x27;t have paternity leave is totally unfounded. In fact, the U.S. Government as an employer has pretty damn strong maternity&#x2F;paternity leave policies.[1] I know of many private companies that also have great maternity&#x2F;paternity leave policies.[2]People seem to want the government to mandate the private sector implement these policies, however the U.S. Code is not structured in a way that encourages restrictions on private companies in this way.[1]http:&#x2F;&#x2F;www.opm.gov&#x2F;policy-data-oversight&#x2F;pay-leave&#x2F;leave-adm...[2]http:&#x2F;&#x2F;www.workingmother.com&#x2F;best-companies&#x2F;ibm-9", "score": 1}, {"text": "There&#x27;s a lot more than just maternity (or paternity) leave holding back Japanese women: the cultural expectation remain that women are there to pour cups of tea, marry eligible salarymen, and drop out and rear their kids while said salarymen work insane hours.My wife (MBA, ex-Microsoftie, etc; not your average &quot;office lady&quot;) briefly worked for a super-old-school Japanese trading company in Australia.  Her boss wanted her to go on a business trip to suppliers in Japan with a client; HQ held out as long as they could (because what would the suppliers think if they sent a woman?), but eventually gave in because there was nobody else suitable.  So they called up all the employees and proudly announced: We&#x27;re sending a woman to Japan, for the first time ever!  Everybody, a round of applause at how progressive we are!So when was this?  In the 1970s, perhaps?  Nope: 2011.", "score": 0}]}

  ]
}